tests/load/api-crud.yml
# API CRUD 부하 테스트 — 인증 필요 엔드포인트
# 목표: p95 < 1000ms
# 환경변수: LOAD_TEST_TARGET, LOAD_TEST_COOKIE
config:
  target: "{{ $processEnvironment.LOAD_TEST_TARGET }}"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm-up"
    - duration: 60
      arrivalRate: 5
      name: "Ramp-up"
    - duration: 30
      arrivalRate: 10
      name: "Peak"
  defaults:
    headers:
      Accept: "application/json"
      Cookie: "{{ $processEnvironment.LOAD_TEST_COOKIE }}"
  ensure:
    thresholds:
      - http.response_time.p95: 1000
      - http.response_time.p99: 2000

scenarios:
  # Discovery 목록 조회
  - name: "Discovery 목록 조회"
    weight: 4
    flow:
      - get:
          url: "/api/discoveries"
          expect:
            - statusCode: 200

  # Recall 통계 조회
  - name: "Recall 통계 조회"
    weight: 3
    flow:
      - get:
          url: "/api/recall-events"
          expect:
            - statusCode: 200

  # 시맨틱 검색 — 다양한 쿼리로 캐시 회피
  - name: "시맨틱 검색"
    weight: 3
    flow:
      - get:
          url: "/api/similar-seeds?query=AI+시장+분석"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/similar-seeds?query=신규+사업+기회"
          expect:
            - statusCode: 200